All our yesterdays (Macbeth)
All that glitters is not gold (The Merchant of Venice)("glisters")
All's well that ends well (title)
As good luck would have it (The Merry Wives of Windsor)
As merry as the day is long (Much Ado About Nothing / King John)
Bated breath (The Merchant of Venice)
Bag and baggage (As You Like It / Winter's Tale)
Bear a charmed life (Macbeth)
Be-all and the end-all (Macbeth)
Beggar all description (Antony and Cleopatra)
Better foot before ("best foot forward") (King John)
The better part of valor is discretion (I Henry IV; possibly already a known saying)
In a better world than this (As You Like It)
Neither a borrower nor a lender be (Hamlet)
Brave new world (The Tempest)
Break the ice (The Taming of the Shrew)
Breathed his last (3 Henry VI)
Brevity is the soul of wit (Hamlet)
Refuse to budge an inch (Measure for Measure / Taming of the Shrew)
Catch a cold (Cymbeline; claimed but seems unlikely, seems to refer to bad weather)
Cold comfort (The Taming of the Shrew / King John)
Conscience does make cowards of us all (Hamlet)
Come what come may ("come what may") (Macbeth)
Comparisons are odorous (Much Ado about Nothing)
Crack of doom (Macbeth)
Dead as a doornail (2 Henry VI)
A dish fit for the gods (Julius Caesar)
Cry havoc and let slip the dogs of war (Julius Caesar)
Dog will have his day (Hamlet; quoted earlier by Erasmus and Queen Elizabeth)
Devil incarnate (Titus Andronicus / Henry V)
Eaten me out of house and home (2 Henry IV)
Elbow room (King John; first attested 1540 according to Merriam-Webster)
Farewell to all my greatness (Henry VIII)
Faint hearted (I Henry VI)
Fancy-free (Midsummer Night's Dream)
Fight till the last gasp (I Henry VI)
Flaming youth (Hamlet)
Forever and a day (As You Like It)
For goodness' sake (Henry VIII)
Foregone conclusion (Othello)
Full circle (King Lear)
The game is afoot (I Henry IV)
The game is up (Cymbeline)
Give the devil his due (I Henry IV)
Good riddance (Troilus and Cressida)
Jealousy is the green-eyed monster (Othello)
It was Greek to me (Julius Caesar)
Heart of gold (Henry V)
Her infinite variety (Antony and Cleopatra)
'Tis high time (The Comedy of Errors)
Hoist with his own petard (Hamlet)
Household words (Henry V)
A horse, a horse!  My kingdom for a horse! (Richard III)
Ill wind which blows no man to good (2 Henry IV)
Improbable fiction (Twelfth Night)
In a pickle (The Tempest)
In my heart of hearts (Hamlet)
In my mind's eye (Hamlet)
Infinite space (Hamlet)
Infirm of purpose (Macbeth)
In my book of memory (I Henry VI)
It is but so-so(As You Like It)
It smells to heaven (Hamlet)
Itching palm (Julius Caesar)
Kill with kindness (Taming of the Shrew)
Killing frost (Henry VIII)
Knit brow (The Rape of Lucrece)
Knock knock!  Who's there? (Macbeth)
Laid on with a trowel (As You Like It)
Laughing stock (The Merry Wives of Windsor)
Laugh yourself into stitches (Twelfth Night)
Lean and hungry look (Julius Caesar)
Lie low (Much Ado about Nothing)
Live long day (Julius Caesar)
Love is blind (Merchant of Venice)
Men's evil manners live in brass; their virtues we write in water (Henry VIII)
Melted into thin air (The Tempest)
Though this be madness, yet there is method in it ("There's a method to my madness") (Hamlet)
Make a virtue of necessity (The Two Gentlemen of Verona)
The Makings of(Henry VIII)
Milk of human kindness (Macbeth)
Ministering angel (Hamlet)
Misery acquaints a man with strange bedfellows (The Tempest)
More honored in the breach than in the observance (Hamlet)
More in sorrow than in anger (Hamlet)
More sinned against than sinning (King Lear)
Much Ado About Nothing (title)
Murder most foul (Hamlet)
Naked truth (Love's Labours Lost)
Neither rhyme nor reason (As You Like It)
Not slept one wink (Cymbeline)
Nothing in his life became him like the leaving it (Macbeth)
[Obvious] as a nose on a man's face (The Two Gentlemen of Verona)
Once more into the breach (Henry V)
One fell swoop (Macbeth)
One that loved not wisely but too well (Othello)
Time is out of joint (Hamlet)
Out of the jaws of death (Twelfth Night)
Own flesh and blood (Hamlet)
Star-crossed lovers (Romeo and Juliet)
Parting is such sweet sorrow (Romeo and Juliet)
What's past is prologue (The Tempest)
[What] a piece of work [is man] (Hamlet)
Pitched battle (Taming of the Shrew)
A plague on both your houses (Romeo and Juliet)
Play fast and loose (King John)
Pomp and circumstance (Othello)
[A poor] thing, but mine own (As You Like It)
Pound of flesh (The Merchant of Venice)
Primrose path (Hamlet)
Quality of mercy is not strained (The Merchant of Venice)
Salad days (Antony and Cleopatra)
Sea change (The Tempest)
Seen better days (As You Like It? Timon of Athens?)
Send packing (I Henry IV)
How sharper than the serpent's tooth it is to have a thankless child (King Lear)
Shall I compare thee to a summer's day (Sonnets)
Make short shrift (Richard III)
Sick at heart (Hamlet)
Snail paced (Troilus and Cressida)
Something in the wind (The Comedy of Errors)
Something wicked this way comes (Macbeth)
A sorry sight (Macbeth)
Sound and fury (Macbeth)
Spotless reputation (Richard II)
Stony hearted (I Henry IV)
Such stuff as dreams are made on (The Tempest)
Smooth runs the water where the brook is deep ("Still waters run deep") (2 Henry VI)
The short and the long of it (The Merry Wives of Windsor)
Sweet are the uses of adversity (As You Like It)
Sweets to the sweet (Hamlet)
Swift as a shadow (A Midsummer Night's Dream
Tedious as a twice-told tale (King John)
Set my teeth on edge (I Henry IV)
Tell truth and shame the devil (1 Henry IV)
Thereby hangs a tale (Othello; in context, this seems to have been already in use)
There's no such thing (?) (Macbeth)
There's the rub (Hamlet)
This mortal coil (Hamlet)
To gild refined gold, to paint the lily ("to gild the lily") (King John)
To thine own self be true (Hamlet)
Too much of a good thing (As You Like It)
Tower of strength (Richard III)
Towering passion (Hamlet)
Trippingly on the tongue (Hamlet)
Truth will out (The Merchant of Venice)
Violent delights have violent ends (Romeo and Juliet)
Wear my heart upon my sleeve (Othello)
What the dickens (The Merry Wives of Windsor)
What's done is done (Macbeth)
What's in a name?  A rose by any other name would smell as sweet. (Romeo and Juliet)
What fools these mortals be (A Midsummer Night's Dream)
What the dickens (The Merry Wives of Windsor)
Wild-goose chase (Romeo and Juliet)
Wish is father to that thought (2 Henry IV)
Witching time of night (Hamlet)
Working-day world (As You Like It)
The world's my oyster (Merry Wives of Windsor)
Yeoman's service (Hamlet)
